In [17]:
#always remember to run this line to access all the attributes of pandas

import pandas as pd
import numpy as np

# Data Frame Part 1 & 2

In [3]:
#series store data in one dimention, if we wanna store data in multiple dimention then we use data frame
#Series: one-D (index, key) one row & one column
#Data Frame: Multiple-D (one row with multiple columns)
#We can merge two or more series to create data frame, but remember if index is not same than values will not be merge

apples = pd.Series([1,3,5,7,9])
oranges = pd.Series([2,4,6,8,10])

# "Apples" and "Oranges" are the keys and apples and oranges are values in data frame
data = {"Apples": apples, "Oranges": oranges}
data_of_fruits = pd.DataFrame(data)
print(data_of_fruits)

   Apples  Oranges
0       1        2
1       3        4
2       5        6
3       7        8
4       9       10

In [ ]:
# we should avoid copy n paste the code, write the codes to avoid simple mistakes like semi colons and calling problems
# we should also learn to understand what kind of error is it and how to remove error

# Data Frame Part 3

In [11]:
cities = ["Karachi", "Lahore", "Multan", "Rawalpindi", "Islamabad", "Peshawar"]
year = [2019, 2019, 2019, 2020, "2016 & 2018", 2017]
last_fight = ["Elimination round", "Eliminate", "Eliminate", "Eliminate", "2 Trophies", "1 Trophy"]

data_two = {"Cities": cities, "Years": year, "Last Fight": last_fight}
index_of_content = ['1st', '2nd', '3rd', '4th', '5th', '6th']  #we have to give index = no of values
data_of_cities_df = pd.DataFrame(data_two, index = index_of_content) 
#if index is more or less than no of value tha it's generate valueError
print(data_of_cities_df) #df = data frame

         Cities        Years         Last Fight
1st     Karachi         2019  Elimination round
2nd      Lahore         2019          Eliminate
3rd      Multan         2019          Eliminate
4th  Rawalpindi         2020          Eliminate
5th   Islamabad  2016 & 2018         2 Trophies
6th    Peshawar         2017           1 Trophy

# Data Frame Part 4

In [12]:
data_of_cities_df.head()   #.head() gives you the top 5 values of your data

         Cities        Years         Last Fight
1st     Karachi         2019  Elimination round
2nd      Lahore         2019          Eliminate
3rd      Multan         2019          Eliminate
4th  Rawalpindi         2020          Eliminate
5th   Islamabad  2016 & 2018         2 Trophies

In [19]:
#we can arrange row and columns as we want

banana = pd.Series([1,3,5,7,9])
mangoes = pd.Series([2,4,6,8,10])

data = {"Bananas": banana, "Mangoes": mangoes}
data_of_fruits_two = pd.DataFrame(data)
print(data_of_fruits_two)

column_of_fruits_df = ["Mangoes", "Bananas"]
data_of_fruits_two = pd.DataFrame(data, columns = column_of_fruits_df)
# by columns, we can change the columns but content remain same
#and helding it, by
data_of_fruits_two.head()

   Bananas  Mangoes
0        1        2
1        3        4
2        5        6
3        7        8
4        9       10

   Mangoes  Bananas
0        2        1
1        4        3
2        6        5
3        8        7
4       10        9

# Data Frame Part 5

In [82]:
banana = pd.Series([10,30,50,70,90,110])
mangoes = pd.Series([20,40,60,80,100,120])
years = pd.Series([2000, 2002, 2005, 2007, 2009,2012])

data_fruits = {"Bananas": banana, "Mangoes": mangoes, "Years": years}
data_fruits = pd.DataFrame(data_fruits, columns = ['Years', 'Mangoes', 'Bananas', 'Graphs'])
print(data_of_fruits_three)

   Years  Mangoes  Bananas Graphs
0   2000       20       10    NaN
1   2002       40       30    NaN
2   2005       60       50    NaN
3   2007       80       70    NaN
4   2009      100       90    NaN
5   2012      120      110    NaN

In [84]:
print(data_fruits)
data_fruits_two = pd.DataFrame(data_fruits,)
print("\n")
data_fruits_two.head()

   Years  Mangoes  Bananas Graphs
0   2000       20       10    NaN
1   2002       40       30    NaN
2   2005       60       50    NaN
3   2007       80       70    NaN
4   2009      100       90    NaN
5   2012      120      110    NaN

   Years  Mangoes  Bananas Graphs
0   2000       20       10    NaN
1   2002       40       30    NaN
2   2005       60       50    NaN
3   2007       80       70    NaN
4   2009      100       90    NaN

In [76]:
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']
data = {'state': state ,
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
state_pop_df = pd.DataFrame(data 
                     , index = ['1st', '2nd', '3rd', 
                                '4th', '5th','6th'] )
print(state_pop_df)
#state_pop_df.head()
state_pop_df =pd.DataFrame(data, columns=['year', 'state', 'pop'])
print("\n")
print(state_pop_df)
frame2 = pd.DataFrame(data, 
                      columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])
print("\n")
frame2.head()

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2


   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [53]:
data_of_fruits_four.columns
#index shows on output tells that, which object will be traverse

Index(['Years', 'Mangoes', 'Bananas', 'Graphs'], dtype='object')

In [55]:
data_of_fruits_four.index
#index shows on output tells that, which object will be traverse

Index(['1st', '2nd', '3rd', '4th', '5th'], dtype='object')

# Data Frame Part 6 & 7

In [6]:
state = ['Karachi', 'Karachi', 'Karachi', 'Lahore', 'Lahore', 'Lahore']
year = [2000, 2001, 2002, 2001, 2002, 2003]
population = [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]

Pak_data = {
    "State" : state,
    "Years" : year,
    "Population" : population
}

df_Pak_data = pd.DataFrame(Pak_data, index= ['1st', '2nd', '3rd', 
                                '4th', '5th','6th'])

df_Pak_data

       State  Years  Population
1st  Karachi   2000         1.5
2nd  Karachi   2001         1.7
3rd  Karachi   2002         3.6
4th   Lahore   2001         2.4
5th   Lahore   2002         2.9
6th   Lahore   2003         3.2

In [7]:
df_Pak_data["Years"]
#this is dictionary like notation to access the data(dataframe column's data)

1st    2000
2nd    2001
3rd    2002
4th    2001
5th    2002
6th    2003
Name: Years, dtype: int64

In [8]:
#there is another way to access data by attribute style
df_Pak_data.State

1st    Karachi
2nd    Karachi
3rd    Karachi
4th     Lahore
5th     Lahore
6th     Lahore
Name: State, dtype: object

In [10]:
df_Pak_data.head()    #.head() gives you the top 5 values of your data

       State  Years  Population
1st  Karachi   2000         1.5
2nd  Karachi   2001         1.7
3rd  Karachi   2002         3.6
4th   Lahore   2001         2.4
5th   Lahore   2002         2.9

In [9]:
#we can access the data of whole row of any particular DataFrame by loc attribute
#print/show the whole data of any particular row from the DataFrame
#but data always return in column wise form,
df_Pak_data.loc["1st"]

State         Karachi
Years            2000
Population        1.5
Name: 1st, dtype: object

# DataFrame Part 8 & 9

In [32]:
# use df_Pak_data from previous shell
df_Pak_data = pd.DataFrame(Pak_data,
                           columns = ["State", "Years", "Population", "Rank"],
                           index = ['1st', '2nd', '3rd', '4th', '5th','6th'])

df_Pak_data

       State  Years  Population Rank
1st  Karachi   2000         1.5  NaN
2nd  Karachi   2001         1.7  NaN
3rd  Karachi   2002         3.6  NaN
4th   Lahore   2001         2.4  NaN
5th   Lahore   2002         2.9  NaN
6th   Lahore   2003         3.2  NaN

In [24]:
ln = len(df_Pak_data)  #to find out n of rows in dataframe, ln has the length of dataframe
#now creating an numpy array
numpy_arr = np.arange(ln)
numpy_arr

array([0, 1, 2, 3, 4, 5])

In [33]:
#point to remember, inserting new values need to be match in length of DataFrame(number of element)
#the number of time you run this block, Rank values increase ++1
df_Pak_data["Rank"] = numpy_arr + 1
df_Pak_data

       State  Years  Population  Rank
1st  Karachi   2000         1.5     1
2nd  Karachi   2001         1.7     2
3rd  Karachi   2002         3.6     3
4th   Lahore   2001         2.4     4
5th   Lahore   2002         2.9     5
6th   Lahore   2003         3.2     6

In [35]:
# remember, index length must be equal to values (or, don't provide index)
# columns can be modified by assignment. For example, the empty "Rank" column could be assigned a scaler value
# or an array of value(gives single value to every column).

state = ['Karachi', 'Karachi', 'Karachi', 'Lahore', 'Lahore', 'Lahore']
year = [2000, 2001, 2002, 2001, 2002, 2003]
population = [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]

Pak_data_two = {
    "State" : state,
    "Years" : year,
    "Population" : population
}

df_Pak_data_two = pd.DataFrame(Pak_data,
                           columns = ["State", "Years", "Population", "Cricket Junoon"],
                           index = ['1st', '2nd', '3rd', '4th', '5th','6th'])

df_Pak_data_two

       State  Years  Population Cricket Junoon
1st  Karachi   2000         1.5            NaN
2nd  Karachi   2001         1.7            NaN
3rd  Karachi   2002         3.6            NaN
4th   Lahore   2001         2.4            NaN
5th   Lahore   2002         2.9            NaN
6th   Lahore   2003         3.2            NaN

In [37]:
df_Pak_data_two["Cricket Junoon"] = "100%"
df_Pak_data_two

       State  Years  Population Cricket Junoon
1st  Karachi   2000         1.5           100%
2nd  Karachi   2001         1.7           100%
3rd  Karachi   2002         3.6           100%
4th   Lahore   2001         2.4           100%
5th   Lahore   2002         2.9           100%
6th   Lahore   2003         3.2           100%